others/项目构建笔记.org
* 配置文件
** web.xml 配置
*** log4j 日志配置
  #+BEGIN_SRC xml
    <!-- web.xml -->
    <!-- log4j 配置  开始 -->
      <context-param>
          <param-name>log4jConfigLocation</param-name>
          <param-value>/WEB-INF/classes/log4j.properties</param-value>
      </context-param>
      <context-param>
          <param-name>log4jRefreshInterval</param-name>
          <param-value>600000</param-value>
      </context-param>
      <context-param>
          <param-name>webAppRootKey</param-name>
          <param-value>javass.webapp.root</param-value>
      </context-param>
      <listener>
          <listener-class>org.springframework.web.util.Log4jConfigListener</listener-class>
      </listener>
      <!-- log4j 配置  结束 -->
   #+END_SRC
*** servlet 的编码
  #+BEGIN_SRC xml
     <!-- web.xml -->
      <!-- 设置servlet编码开始 -->
	<filter>
	    <filter-name>Set Character Encoding</filter-name>
	    <filter-class>org.springframework.web.filter.CharacterEncodingFilter</filter-class>
	    <init-param>
		<param-name>encoding</param-name>
		<param-value>UTF-8</param-value>
	    </init-param>
	    <init-param>
		<param-name>forceEncoding</param-name>
		<param-value>true</param-value>
	    </init-param>
	</filter>

	<filter-mapping>
	    <filter-name>Set Character Encoding</filter-name>
	    <url-pattern>/*</url-pattern>
	</filter-mapping>
	<!-- 设置servlet编码结束 -->
      #+END_SRC
***  自定义的拦截器
  #+BEGIN_SRC xml
                <!-- web.xml -->
       	     <!-- 设置BackURL开始 -->    
       	   <filter>
               <filter-name>BackURLFilter</filter-name>
               <filter-class>cn.javass.common.web.filter.BackURLFilter</filter-class>
       	   </filter>

       	   <filter-mapping>
               <filter-name>BackURLFilter</filter-name>
               <url-pattern>/*</url-pattern>
       	   </filter-mapping>
       	   <!-- 设置BackURL结束 --> 
    #+END_SRC
*** spring 的配置文件
  #+BEGIN_SRC xml
      <!-- web.xml -->
       	  <!-- Spring配置文件开始  -->    
       	     <context-param>
               	 <param-name>contextConfigLocation</param-name>
               	 <param-value>
               	     classpath:spring-config.xml
               	 </param-value>
       	     </context-param>
    #+END_SRC
*** sping-mvc的配置
  #+BEGIN_SRC xml
   <!-- web.xml -->
       	      <listener>
               	   <listener-class>
               	       org.springframework.web.context.ContextLoaderListener
               	   </listener-class>
       	       </listener>
       	       <!-- Spring配置文件结束 -->
    #+END_SRC
*** 隐藏http方法的监听器
  #+BEGIN_SRC xml
   <!-- web.xml -->
		  <filter>
		     <filter-name>HiddenHttpMethodFilter</filter-name>
		     <filter-class>org.springframework.web.filter.HiddenHttpMethodFilter</filter-class>
		 </filter>
		 <filter-mapping>
		     <filter-name>HiddenHttpMethodFilter</filter-name>
		     <servlet-name>spring</servlet-name>
		 </filter-mapping>
   #+END_SRC
