others/项目构建笔记.html
<?xml version="1.0" encoding="gb2312"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>项目构建笔记</title>
<meta http-equiv="Content-Type" content="text/html;charset=gb2312"/>
<meta name="title" content="项目构建笔记"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-11-27T11:24+0800"/>
<meta name="author" content="emacsers"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" type="text/css" href="org.css">

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">项目构建笔记</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 配置文件</a>
<ul>
<li><a href="#sec-1-1">1.1 web.xml 配置</a>
<ul>
<li><a href="#sec-1-1-1">1.1.1 log4j 日志配置</a></li>
<li><a href="#sec-1-1-2">1.1.2 servlet 的编码</a></li>
<li><a href="#sec-1-1-3">1.1.3 自定义的拦截器</a></li>
<li><a href="#sec-1-1-4">1.1.4 spring 的配置文件</a></li>
<li><a href="#sec-1-1-5">1.1.5 sping-mvc的配置</a></li>
<li><a href="#sec-1-1-6">1.1.6 隐藏http方法的监听器</a></li>
<li><a href="#sec-1-1-7">1.1.7 spring 的注册</a></li>
</ul>
</li>
<li><a href="#sec-1-2">1.2 数据库的配置</a>
<ul>
<li><a href="#sec-1-2-1">1.2.1 用 properties 文件来配置数据库相关信息</a></li>
<li><a href="#sec-1-2-2">1.2.2 hibernate配置相关</a></li>
<li><a href="#sec-1-2-3">1.2.3 数据库连接配置</a></li>
<li><a href="#sec-1-2-4">1.2.4 连接池配置</a></li>
</ul>
</li>
<li><a href="#sec-1-3">1.3 日志配置</a>
<ul>
<li><a href="#sec-1-3-1">1.3.1 命令行中的日志配置</a></li>
<li><a href="#sec-1-3-2">1.3.2 将日志输出到文件中</a></li>
<li><a href="#sec-1-3-3">1.3.3 日志输出的级别</a></li>
</ul>
</li>
<li><a href="#sec-1-4">1.4 spring的基本配置</a>
<ul>
<li><a href="#sec-1-4-1">1.4.1 注解扫描包</a></li>
<li><a href="#sec-1-4-2">1.4.2 资源文件</a></li>
<li><a href="#sec-1-4-3">1.4.3 国际化的消息资源文件</a></li>
<li><a href="#sec-1-4-4">1.4.4 spring中数据源的配置</a></li>
<li><a href="#sec-1-4-5">1.4.5 spring中session工厂的配置</a></li>
<li><a href="#sec-1-4-6">1.4.6 开启aop的监听</a></li>
<li><a href="#sec-1-4-7">1.4.7 开启aop的注解事务</a></li>
</ul>
</li>
<li><a href="#sec-1-5">1.5 spring-mvc配置</a>
<ul>
<li><a href="#sec-1-5-1">1.5.1 自定义类型绑定接口</a></li>
<li><a href="#sec-1-5-2">1.5.2 开启springmvn的注解</a></li>
<li><a href="#sec-1-5-3">1.5.3 视图配置</a></li>
<li><a href="#sec-1-5-4">1.5.4 json视图</a></li>
<li><a href="#sec-1-5-5">1.5.5 上传配置</a></li>
<li><a href="#sec-1-5-6">1.5.6 异常控制</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 配置文件</h2>
<div class="outline-text-2" id="text-1">


</div>

<div id="outline-container-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> web.xml 配置</h3>
<div class="outline-text-3" id="text-1-1">


</div>

<div id="outline-container-1-1-1" class="outline-4">
<h4 id="sec-1-1-1"><span class="section-number-4">1.1.1</span> log4j 日志配置</h4>
<div class="outline-text-4" id="text-1-1-1">




<pre class="src src-xml"><span style="color: #b22222;">&lt;!--</span><span style="color: #b22222;"> web.xml </span><span style="color: #b22222;">--&gt;</span>
<span style="color: #b22222;">&lt;!--</span><span style="color: #b22222;"> log4j &#37197;&#32622;  &#24320;&#22987; </span><span style="color: #b22222;">--&gt;</span>
  &lt;<span style="color: #0000ff;">context-param</span>&gt;
      &lt;<span style="color: #0000ff;">param-name</span>&gt;log4jConfigLocation&lt;/<span style="color: #0000ff;">param-name</span>&gt;
      &lt;<span style="color: #0000ff;">param-value</span>&gt;/WEB-INF/classes/log4j.properties&lt;/<span style="color: #0000ff;">param-value</span>&gt;
  &lt;/<span style="color: #0000ff;">context-param</span>&gt;
  &lt;<span style="color: #0000ff;">context-param</span>&gt;
      &lt;<span style="color: #0000ff;">param-name</span>&gt;log4jRefreshInterval&lt;/<span style="color: #0000ff;">param-name</span>&gt;
      &lt;<span style="color: #0000ff;">param-value</span>&gt;600000&lt;/<span style="color: #0000ff;">param-value</span>&gt;
  &lt;/<span style="color: #0000ff;">context-param</span>&gt;
  &lt;<span style="color: #0000ff;">context-param</span>&gt;
      &lt;<span style="color: #0000ff;">param-name</span>&gt;webAppRootKey&lt;/<span style="color: #0000ff;">param-name</span>&gt;
      &lt;<span style="color: #0000ff;">param-value</span>&gt;javass.webapp.root&lt;/<span style="color: #0000ff;">param-value</span>&gt;
  &lt;/<span style="color: #0000ff;">context-param</span>&gt;
  &lt;<span style="color: #0000ff;">listener</span>&gt;
      &lt;<span style="color: #0000ff;">listener-class</span>&gt;org.springframework.web.util.Log4jConfigListener&lt;/<span style="color: #0000ff;">listener-class</span>&gt;
  &lt;/<span style="color: #0000ff;">listener</span>&gt;
  <span style="color: #b22222;">&lt;!--</span><span style="color: #b22222;"> log4j &#37197;&#32622;  &#32467;&#26463; </span><span style="color: #b22222;">--&gt;</span>
</pre>

</div>

</div>

<div id="outline-container-1-1-2" class="outline-4">
<h4 id="sec-1-1-2"><span class="section-number-4">1.1.2</span> servlet 的编码</h4>
<div class="outline-text-4" id="text-1-1-2">




<pre class="src src-xml"><span style="color: #b22222;">&lt;!--</span><span style="color: #b22222;"> web.xml </span><span style="color: #b22222;">--&gt;</span>
 <span style="color: #b22222;">&lt;!--</span><span style="color: #b22222;"> &#35774;&#32622;servlet&#32534;&#30721;&#24320;&#22987; </span><span style="color: #b22222;">--&gt;</span>
   &lt;<span style="color: #0000ff;">filter</span>&gt;
       &lt;<span style="color: #0000ff;">filter-name</span>&gt;Set Character Encoding&lt;/<span style="color: #0000ff;">filter-name</span>&gt;
       &lt;<span style="color: #0000ff;">filter-class</span>&gt;org.springframework.web.filter.CharacterEncodingFilter&lt;/<span style="color: #0000ff;">filter-class</span>&gt;
       &lt;<span style="color: #0000ff;">init-param</span>&gt;
           &lt;<span style="color: #0000ff;">param-name</span>&gt;encoding&lt;/<span style="color: #0000ff;">param-name</span>&gt;
           &lt;<span style="color: #0000ff;">param-value</span>&gt;UTF-8&lt;/<span style="color: #0000ff;">param-value</span>&gt;
       &lt;/<span style="color: #0000ff;">init-param</span>&gt;
       &lt;<span style="color: #0000ff;">init-param</span>&gt;
           &lt;<span style="color: #0000ff;">param-name</span>&gt;forceEncoding&lt;/<span style="color: #0000ff;">param-name</span>&gt;
           &lt;<span style="color: #0000ff;">param-value</span>&gt;true&lt;/<span style="color: #0000ff;">param-value</span>&gt;
       &lt;/<span style="color: #0000ff;">init-param</span>&gt;
   &lt;/<span style="color: #0000ff;">filter</span>&gt;

   &lt;<span style="color: #0000ff;">filter-mapping</span>&gt;
       &lt;<span style="color: #0000ff;">filter-name</span>&gt;Set Character Encoding&lt;/<span style="color: #0000ff;">filter-name</span>&gt;
       &lt;<span style="color: #0000ff;">url-pattern</span>&gt;/*&lt;/<span style="color: #0000ff;">url-pattern</span>&gt;
   &lt;/<span style="color: #0000ff;">filter-mapping</span>&gt;
   <span style="color: #b22222;">&lt;!--</span><span style="color: #b22222;"> &#35774;&#32622;servlet&#32534;&#30721;&#32467;&#26463; </span><span style="color: #b22222;">--&gt;</span>
</pre>

</div>

</div>

<div id="outline-container-1-1-3" class="outline-4">
<h4 id="sec-1-1-3"><span class="section-number-4">1.1.3</span> 自定义的拦截器</h4>
<div class="outline-text-4" id="text-1-1-3">




<pre class="src src-xml">     <span style="color: #b22222;">&lt;!--</span><span style="color: #b22222;"> web.xml </span><span style="color: #b22222;">--&gt;</span>
  <span style="color: #b22222;">&lt;!--</span><span style="color: #b22222;"> &#35774;&#32622;BackURL&#24320;&#22987; </span><span style="color: #b22222;">--&gt;</span>    
&lt;<span style="color: #0000ff;">filter</span>&gt;
    &lt;<span style="color: #0000ff;">filter-name</span>&gt;BackURLFilter&lt;/<span style="color: #0000ff;">filter-name</span>&gt;
    &lt;<span style="color: #0000ff;">filter-class</span>&gt;cn.javass.common.web.filter.BackURLFilter&lt;/<span style="color: #0000ff;">filter-class</span>&gt;
&lt;/<span style="color: #0000ff;">filter</span>&gt;

&lt;<span style="color: #0000ff;">filter-mapping</span>&gt;
    &lt;<span style="color: #0000ff;">filter-name</span>&gt;BackURLFilter&lt;/<span style="color: #0000ff;">filter-name</span>&gt;
    &lt;<span style="color: #0000ff;">url-pattern</span>&gt;/*&lt;/<span style="color: #0000ff;">url-pattern</span>&gt;
&lt;/<span style="color: #0000ff;">filter-mapping</span>&gt;
<span style="color: #b22222;">&lt;!--</span><span style="color: #b22222;"> &#35774;&#32622;BackURL&#32467;&#26463; </span><span style="color: #b22222;">--&gt;</span> 
</pre>

</div>

</div>

<div id="outline-container-1-1-4" class="outline-4">
<h4 id="sec-1-1-4"><span class="section-number-4">1.1.4</span> spring 的配置文件</h4>
<div class="outline-text-4" id="text-1-1-4">




<pre class="src src-xml"><span style="color: #b22222;">&lt;!--</span><span style="color: #b22222;"> web.xml </span><span style="color: #b22222;">--&gt;</span>
    <span style="color: #b22222;">&lt;!--</span><span style="color: #b22222;"> Spring&#37197;&#32622;&#25991;&#20214;&#24320;&#22987;  </span><span style="color: #b22222;">--&gt;</span>    
       &lt;<span style="color: #0000ff;">context-param</span>&gt;
           &lt;<span style="color: #0000ff;">param-name</span>&gt;contextConfigLocation&lt;/<span style="color: #0000ff;">param-name</span>&gt;
           &lt;<span style="color: #0000ff;">param-value</span>&gt;
               classpath:spring-config.xml
           &lt;/<span style="color: #0000ff;">param-value</span>&gt;
       &lt;/<span style="color: #0000ff;">context-param</span>&gt;
</pre>

</div>

</div>

<div id="outline-container-1-1-5" class="outline-4">
<h4 id="sec-1-1-5"><span class="section-number-4">1.1.5</span> sping-mvc的配置</h4>
<div class="outline-text-4" id="text-1-1-5">




<pre class="src src-xml"><span style="color: #b22222;">&lt;!--</span><span style="color: #b22222;"> web.xml </span><span style="color: #b22222;">--&gt;</span>
           &lt;<span style="color: #0000ff;">listener</span>&gt;
                &lt;<span style="color: #0000ff;">listener-class</span>&gt;
                    org.springframework.web.context.ContextLoaderListener
                &lt;/<span style="color: #0000ff;">listener-class</span>&gt;
            &lt;/<span style="color: #0000ff;">listener</span>&gt;
            <span style="color: #b22222;">&lt;!--</span><span style="color: #b22222;"> Spring&#37197;&#32622;&#25991;&#20214;&#32467;&#26463; </span><span style="color: #b22222;">--&gt;</span>
</pre>

</div>

</div>

<div id="outline-container-1-1-6" class="outline-4">
<h4 id="sec-1-1-6"><span class="section-number-4">1.1.6</span> 隐藏http方法的监听器</h4>
<div class="outline-text-4" id="text-1-1-6">




<pre class="src src-xml"><span style="color: #b22222;">&lt;!--</span><span style="color: #b22222;"> web.xml </span><span style="color: #b22222;">--&gt;</span>
               &lt;<span style="color: #0000ff;">filter</span>&gt;
                  &lt;<span style="color: #0000ff;">filter-name</span>&gt;HiddenHttpMethodFilter&lt;/<span style="color: #0000ff;">filter-name</span>&gt;
                  &lt;<span style="color: #0000ff;">filter-class</span>&gt;org.springframework.web.filter.HiddenHttpMethodFilter&lt;/<span style="color: #0000ff;">filter-class</span>&gt;
              &lt;/<span style="color: #0000ff;">filter</span>&gt;
              &lt;<span style="color: #0000ff;">filter-mapping</span>&gt;
                  &lt;<span style="color: #0000ff;">filter-name</span>&gt;HiddenHttpMethodFilter&lt;/<span style="color: #0000ff;">filter-name</span>&gt;
                  &lt;<span style="color: #0000ff;">servlet-name</span>&gt;spring&lt;/<span style="color: #0000ff;">servlet-name</span>&gt;
              &lt;/<span style="color: #0000ff;">filter-mapping</span>&gt;
</pre>

</div>

</div>
