others/项目构建笔记.org
*** spring 的注册
 #+BEGIN_SRC xml
  <!-- web.xml -->
 <servlet>
        <servlet-name>spring</servlet-name>
        <servlet-class>org.springframework.web.servlet.DispatcherServlet</servlet-class>
        <init-param>
            <param-name>contextConfigLocation</param-name>
            <param-value>classpath:spring-servlet.xml</param-value>
        </init-param>
        <load-on-startup>1</load-on-startup>
    </servlet>

    <servlet-mapping>
        <servlet-name>spring</servlet-name>
        <url-pattern>/</url-pattern>
    </servlet-mapping>
 #+END_SRC

** 数据库的配置
*** 用 properties 文件来配置数据库相关信息
*** hibernate配置相关
 #+BEGIN_SRC proerties
 # resources.properties
 hibernate.dialect=org.hibernate.dialect.MySQLInnoDBDialect
hibernate.hbm2ddl.auto=none
hibernate.show_sql=false
hibernate.query.substitutions=true 1, false 0
hibernate.default_batch_fetch_size=16
hibernate.max_fetch_depth=2
hibernate.bytecode.use_reflection_optimizer=true
hibernate.cache.use_second_level_cache=true
hibernate.cache.use_query_cache=true
hibernate.cache.region.factory_class=org.hibernate.cache.EhCacheRegionFactory
net.sf.ehcache.configurationResourceName=/ehcache_hibernate.xml
hibernate.cache.use_structured_entries=true
hibernate.generate_statistics=true
 #+END_SRC
*** 数据库连接配置
 #+BEGIN_SRC proerties
 # resources.properties
 connection.driver_class=com.mysql.jdbc.Driver
connection.url=jdbc:mysql://localhost:3306/javassdb?useUnicode=true&amp;characterEncoding=UTF-8
connection.username=DECG
connection.password=DECG
 #+END_SRC
*** 连接池配置
 #+BEGIN_SRC proerties
 # resources.properties
 proxool.maximum.connection.count=40
proxool.minimum.connection.count=5
proxool.statistics=1m,15m,1h,1d
proxool.simultaneous.build.throttle=30
 #+END_SRC
** 日志配置
*** 命令行中的日志配置
 #+BEGIN_SRC proerties
  # log4j.properties
 #console log
log4j.appender.CONSOLE=org.apache.log4j.ConsoleAppender
log4j.appender.CONSOLE.layout=org.apache.log4j.PatternLayout
 # 输出的时间格式
log4j.appender.CONSOLE.layout.ConversionPattern=%d{yyyy-MM-dd HH:mm:ss} [%t] %-5p %c - %m%n
 #+END_SRC    
*** 将日志输出到文件中
 #+BEGIN_SRC proerties
  # log4j.properties
 #all log
log4j.appender.DAILY_ALL=org.apache.log4j.DailyRollingFileAppender
log4j.appender.DAILY_ALL.layout=org.apache.log4j.PatternLayout
log4j.appender.DAILY_ALL.layout.ConversionPattern="%p %d{yyyy-MM-dd HH:mm:ss} %-50.50c(%L) - %m%n
log4j.appender.DAILY_ALL.File=D:/Backup/javass-all.log
 #+END_SRC
*** 日志输出的级别
 #+BEGIN_SRC proerties
  # log4j.properties
 log4j.rootLogger=INFO,CONSOLE
 #+END_SRC
** spring的基本配置
*** 注解扫描包
 #+BEGIN_SRC xml
    <!-- spring-config.xml -->
     <!-- 扫描注解Bean -->
    <context:component-scan base-package="cn.javass">
        <context:exclude-filter type="annotation" expression="org.springframework.stereotype.Controller"/>
    </context:component-scan>
 #+END_SRC
*** 资源文件
   #+BEGIN_SRC xml
 <!-- spring-config.xml -->
<bean id="propertyConfigurer" class="org.springframework.beans.factory.config.PropertyPlaceholderConfigurer">
        <property name="locations">
            <list>
                <!-- 配置文件为上面数据库配置的 properties 文件 -->
                <value>classpath:resources.properties</value>
            </list>
        </property>
    </bean>
   #+END_SRC
*** 国际化的消息资源文件
  #+BEGIN_SRC xml
  <!-- 国际化的消息资源文件 -->
    <bean id="messageSource" class="org.springframework.context.support.ReloadableResourceBundleMessageSource">
        <property name="basenames">
            <list>
                <!-- 在web环境中一定要定位到classpath 否则默认到当前web应用下找  -->
                <value>classpath:messages</value>
            </list>
        </property>
        <property name="defaultEncoding" value="UTF-8"/>
        <property name="cacheSeconds" value="60"/>
    </bean>
 #+END_SRC
