others/项目构建笔记.html

<div id="outline-container-1-1-7" class="outline-4">
<h4 id="sec-1-1-7"><span class="section-number-4">1.1.7</span> spring 的注册</h4>
<div class="outline-text-4" id="text-1-1-7">




<pre class="src src-xml"> <span style="color: #b22222;">&lt;!--</span><span style="color: #b22222;"> web.xml </span><span style="color: #b22222;">--&gt;</span>
&lt;<span style="color: #0000ff;">servlet</span>&gt;
       &lt;<span style="color: #0000ff;">servlet-name</span>&gt;spring&lt;/<span style="color: #0000ff;">servlet-name</span>&gt;
       &lt;<span style="color: #0000ff;">servlet-class</span>&gt;org.springframework.web.servlet.DispatcherServlet&lt;/<span style="color: #0000ff;">servlet-class</span>&gt;
       &lt;<span style="color: #0000ff;">init-param</span>&gt;
           &lt;<span style="color: #0000ff;">param-name</span>&gt;contextConfigLocation&lt;/<span style="color: #0000ff;">param-name</span>&gt;
           &lt;<span style="color: #0000ff;">param-value</span>&gt;classpath:spring-servlet.xml&lt;/<span style="color: #0000ff;">param-value</span>&gt;
       &lt;/<span style="color: #0000ff;">init-param</span>&gt;
       &lt;<span style="color: #0000ff;">load-on-startup</span>&gt;1&lt;/<span style="color: #0000ff;">load-on-startup</span>&gt;
   &lt;/<span style="color: #0000ff;">servlet</span>&gt;

   &lt;<span style="color: #0000ff;">servlet-mapping</span>&gt;
       &lt;<span style="color: #0000ff;">servlet-name</span>&gt;spring&lt;/<span style="color: #0000ff;">servlet-name</span>&gt;
       &lt;<span style="color: #0000ff;">url-pattern</span>&gt;/&lt;/<span style="color: #0000ff;">url-pattern</span>&gt;
   &lt;/<span style="color: #0000ff;">servlet-mapping</span>&gt;
</pre>


</div>
</div>

</div>

<div id="outline-container-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> 数据库的配置</h3>
<div class="outline-text-3" id="text-1-2">


</div>

<div id="outline-container-1-2-1" class="outline-4">
<h4 id="sec-1-2-1"><span class="section-number-4">1.2.1</span> 用 properties 文件来配置数据库相关信息</h4>
<div class="outline-text-4" id="text-1-2-1">

</div>

</div>

<div id="outline-container-1-2-2" class="outline-4">
<h4 id="sec-1-2-2"><span class="section-number-4">1.2.2</span> hibernate配置相关</h4>
<div class="outline-text-4" id="text-1-2-2">




<pre class="src src-proerties"> # resources.properties
 hibernate.dialect=org.hibernate.dialect.MySQLInnoDBDialect
hibernate.hbm2ddl.auto=none
hibernate.show_sql=false
hibernate.query.substitutions=true 1, false 0
hibernate.default_batch_fetch_size=16
hibernate.max_fetch_depth=2
hibernate.bytecode.use_reflection_optimizer=true
hibernate.cache.use_second_level_cache=true
hibernate.cache.use_query_cache=true
hibernate.cache.region.factory_class=org.hibernate.cache.EhCacheRegionFactory
net.sf.ehcache.configurationResourceName=/ehcache_hibernate.xml
hibernate.cache.use_structured_entries=true
hibernate.generate_statistics=true
</pre>

</div>

</div>

<div id="outline-container-1-2-3" class="outline-4">
<h4 id="sec-1-2-3"><span class="section-number-4">1.2.3</span> 数据库连接配置</h4>
<div class="outline-text-4" id="text-1-2-3">




<pre class="src src-proerties"> # resources.properties
 connection.driver_class=com.mysql.jdbc.Driver
connection.url=jdbc:mysql://localhost:3306/javassdb?useUnicode=true&amp;amp;characterEncoding=UTF-8
connection.username=DECG
connection.password=DECG
</pre>

</div>

</div>

<div id="outline-container-1-2-4" class="outline-4">
<h4 id="sec-1-2-4"><span class="section-number-4">1.2.4</span> 连接池配置</h4>
<div class="outline-text-4" id="text-1-2-4">




<pre class="src src-proerties"> # resources.properties
 proxool.maximum.connection.count=40
proxool.minimum.connection.count=5
proxool.statistics=1m,15m,1h,1d
proxool.simultaneous.build.throttle=30
</pre>

</div>
</div>

</div>

<div id="outline-container-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> 日志配置</h3>
<div class="outline-text-3" id="text-1-3">


</div>

<div id="outline-container-1-3-1" class="outline-4">
<h4 id="sec-1-3-1"><span class="section-number-4">1.3.1</span> 命令行中的日志配置</h4>
<div class="outline-text-4" id="text-1-3-1">




<pre class="src src-proerties">  # log4j.properties
 #console log
log4j.appender.CONSOLE=org.apache.log4j.ConsoleAppender
log4j.appender.CONSOLE.layout=org.apache.log4j.PatternLayout
 # &#36755;&#20986;&#30340;&#26102;&#38388;&#26684;&#24335;
log4j.appender.CONSOLE.layout.ConversionPattern=%d{yyyy-MM-dd HH:mm:ss} [%t] %-5p %c - %m%n
</pre>

</div>

</div>

<div id="outline-container-1-3-2" class="outline-4">
<h4 id="sec-1-3-2"><span class="section-number-4">1.3.2</span> 将日志输出到文件中</h4>
<div class="outline-text-4" id="text-1-3-2">




<pre class="src src-proerties">  # log4j.properties
 #all log
log4j.appender.DAILY_ALL=org.apache.log4j.DailyRollingFileAppender
log4j.appender.DAILY_ALL.layout=org.apache.log4j.PatternLayout
log4j.appender.DAILY_ALL.layout.ConversionPattern=<span style="color: #bc8f8f;">"%p %d{yyyy-MM-dd HH:mm:ss} %-50.50c(%L) - %m%n</span>
<span style="color: #bc8f8f;">log4j.appender.DAILY_ALL.File=D:/Backup/javass-all.log</span>
</pre>

</div>

</div>

<div id="outline-container-1-3-3" class="outline-4">
<h4 id="sec-1-3-3"><span class="section-number-4">1.3.3</span> 日志输出的级别</h4>
<div class="outline-text-4" id="text-1-3-3">




<pre class="src src-proerties"> # log4j.properties
log4j.rootLogger=INFO,CONSOLE
</pre>

</div>
</div>

</div>

<div id="outline-container-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> spring的基本配置</h3>
<div class="outline-text-3" id="text-1-4">


</div>

<div id="outline-container-1-4-1" class="outline-4">
<h4 id="sec-1-4-1"><span class="section-number-4">1.4.1</span> 注解扫描包</h4>
<div class="outline-text-4" id="text-1-4-1">




<pre class="src src-xml"><span style="color: #b22222;">&lt;!--</span><span style="color: #b22222;"> spring-config.xml </span><span style="color: #b22222;">--&gt;</span>
 <span style="color: #b22222;">&lt;!--</span><span style="color: #b22222;"> &#25195;&#25551;&#27880;&#35299;Bean </span><span style="color: #b22222;">--&gt;</span>
&lt;<span style="color: #da70d6;">context</span>:<span style="color: #0000ff;">component-scan</span> <span style="color: #b8860b;">base-package</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">cn.javass</span><span style="color: #bc8f8f;">"</span>&gt;
    &lt;<span style="color: #da70d6;">context</span>:<span style="color: #0000ff;">exclude-filter</span> <span style="color: #b8860b;">type</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">annotation</span><span style="color: #bc8f8f;">"</span> <span style="color: #b8860b;">expression</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">org.springframework.stereotype.Controller</span><span style="color: #bc8f8f;">"</span>/&gt;
&lt;/<span style="color: #da70d6;">context</span>:<span style="color: #0000ff;">component-scan</span>&gt;
</pre>

</div>

</div>

<div id="outline-container-1-4-2" class="outline-4">
<h4 id="sec-1-4-2"><span class="section-number-4">1.4.2</span> 资源文件</h4>
<div class="outline-text-4" id="text-1-4-2">




<pre class="src src-xml"> <span style="color: #b22222;">&lt;!--</span><span style="color: #b22222;"> spring-config.xml </span><span style="color: #b22222;">--&gt;</span>
&lt;<span style="color: #0000ff;">bean</span> <span style="color: #b8860b;">id</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">propertyConfigurer</span><span style="color: #bc8f8f;">"</span> <span style="color: #b8860b;">class</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">org.springframework.beans.factory.config.PropertyPlaceholderConfigurer</span><span style="color: #bc8f8f;">"</span>&gt;
        &lt;<span style="color: #0000ff;">property</span> <span style="color: #b8860b;">name</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">locations</span><span style="color: #bc8f8f;">"</span>&gt;
            &lt;<span style="color: #0000ff;">list</span>&gt;
                <span style="color: #b22222;">&lt;!--</span><span style="color: #b22222;"> &#37197;&#32622;&#25991;&#20214;&#20026;&#19978;&#38754;&#25968;&#25454;&#24211;&#37197;&#32622;&#30340; properties &#25991;&#20214; </span><span style="color: #b22222;">--&gt;</span>
                &lt;<span style="color: #0000ff;">value</span>&gt;classpath:resources.properties&lt;/<span style="color: #0000ff;">value</span>&gt;
            &lt;/<span style="color: #0000ff;">list</span>&gt;
        &lt;/<span style="color: #0000ff;">property</span>&gt;
    &lt;/<span style="color: #0000ff;">bean</span>&gt;
</pre>

</div>

</div>

<div id="outline-container-1-4-3" class="outline-4">
<h4 id="sec-1-4-3"><span class="section-number-4">1.4.3</span> 国际化的消息资源文件</h4>
<div class="outline-text-4" id="text-1-4-3">




<pre class="src src-xml"><span style="color: #b22222;">&lt;!--</span><span style="color: #b22222;"> &#22269;&#38469;&#21270;&#30340;&#28040;&#24687;&#36164;&#28304;&#25991;&#20214; </span><span style="color: #b22222;">--&gt;</span>
  &lt;<span style="color: #0000ff;">bean</span> <span style="color: #b8860b;">id</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">messageSource</span><span style="color: #bc8f8f;">"</span> <span style="color: #b8860b;">class</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">org.springframework.context.support.ReloadableResourceBundleMessageSource</span><span style="color: #bc8f8f;">"</span>&gt;
      &lt;<span style="color: #0000ff;">property</span> <span style="color: #b8860b;">name</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">basenames</span><span style="color: #bc8f8f;">"</span>&gt;
          &lt;<span style="color: #0000ff;">list</span>&gt;
              <span style="color: #b22222;">&lt;!--</span><span style="color: #b22222;"> &#22312;web&#29615;&#22659;&#20013;&#19968;&#23450;&#35201;&#23450;&#20301;&#21040;classpath &#21542;&#21017;&#40664;&#35748;&#21040;&#24403;&#21069;web&#24212;&#29992;&#19979;&#25214;  </span><span style="color: #b22222;">--&gt;</span>
              &lt;<span style="color: #0000ff;">value</span>&gt;classpath:messages&lt;/<span style="color: #0000ff;">value</span>&gt;
          &lt;/<span style="color: #0000ff;">list</span>&gt;
      &lt;/<span style="color: #0000ff;">property</span>&gt;
      &lt;<span style="color: #0000ff;">property</span> <span style="color: #b8860b;">name</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">defaultEncoding</span><span style="color: #bc8f8f;">"</span> <span style="color: #b8860b;">value</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">UTF-8</span><span style="color: #bc8f8f;">"</span>/&gt;
      &lt;<span style="color: #0000ff;">property</span> <span style="color: #b8860b;">name</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">cacheSeconds</span><span style="color: #bc8f8f;">"</span> <span style="color: #b8860b;">value</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">60</span><span style="color: #bc8f8f;">"</span>/&gt;
  &lt;/<span style="color: #0000ff;">bean</span>&gt;
</pre>

</div>

</div>
