others/项目构建笔记.html

<div id="outline-container-1-4-4" class="outline-4">
<h4 id="sec-1-4-4"><span class="section-number-4">1.4.4</span> spring中数据源的配置</h4>
<div class="outline-text-4" id="text-1-4-4">




<pre class="src src-xml">&lt;<span style="color: #0000ff;">bean</span> <span style="color: #b8860b;">id</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">dataSource</span><span style="color: #bc8f8f;">"</span> <span style="color: #b8860b;">class</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">org.logicalcobwebs.proxool.ProxoolDataSource</span><span style="color: #bc8f8f;">"</span>&gt;
               &lt;<span style="color: #0000ff;">property</span> <span style="color: #b8860b;">name</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">alias</span><span style="color: #bc8f8f;">"</span> <span style="color: #b8860b;">value</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">proxoolDataSource</span><span style="color: #bc8f8f;">"</span>/&gt;
               &lt;<span style="color: #0000ff;">property</span> <span style="color: #b8860b;">name</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">driver</span><span style="color: #bc8f8f;">"</span> <span style="color: #b8860b;">value</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">${connection.driver_class}</span><span style="color: #bc8f8f;">"</span> /&gt;
               &lt;<span style="color: #0000ff;">property</span> <span style="color: #b8860b;">name</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">driverUrl</span><span style="color: #bc8f8f;">"</span> <span style="color: #b8860b;">value</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">${connection.url}</span><span style="color: #bc8f8f;">"</span> /&gt;
               &lt;<span style="color: #0000ff;">property</span> <span style="color: #b8860b;">name</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">user</span><span style="color: #bc8f8f;">"</span> <span style="color: #b8860b;">value</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">${connection.username}</span><span style="color: #bc8f8f;">"</span> /&gt;
               &lt;<span style="color: #0000ff;">property</span> <span style="color: #b8860b;">name</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">password</span><span style="color: #bc8f8f;">"</span> <span style="color: #b8860b;">value</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">${connection.password}</span><span style="color: #bc8f8f;">"</span> /&gt;
               &lt;<span style="color: #0000ff;">property</span> <span style="color: #b8860b;">name</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">maximumConnectionCount</span><span style="color: #bc8f8f;">"</span> <span style="color: #b8860b;">value</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">${proxool.maximum.connection.count}</span><span style="color: #bc8f8f;">"</span>/&gt;
               &lt;<span style="color: #0000ff;">property</span> <span style="color: #b8860b;">name</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">minimumConnectionCount</span><span style="color: #bc8f8f;">"</span> <span style="color: #b8860b;">value</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">${proxool.minimum.connection.count}</span><span style="color: #bc8f8f;">"</span> /&gt;
               &lt;<span style="color: #0000ff;">property</span> <span style="color: #b8860b;">name</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">statistics</span><span style="color: #bc8f8f;">"</span> <span style="color: #b8860b;">value</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">${proxool.statistics}</span><span style="color: #bc8f8f;">"</span> /&gt;
               &lt;<span style="color: #0000ff;">property</span> <span style="color: #b8860b;">name</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">simultaneousBuildThrottle</span><span style="color: #bc8f8f;">"</span> <span style="color: #b8860b;">value</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">${proxool.simultaneous.build.throttle}</span><span style="color: #bc8f8f;">"</span>/&gt;
       &lt;/<span style="color: #0000ff;">bean</span>&gt;
</pre>

</div>

</div>

<div id="outline-container-1-4-5" class="outline-4">
<h4 id="sec-1-4-5"><span class="section-number-4">1.4.5</span> spring中session工厂的配置</h4>
<div class="outline-text-4" id="text-1-4-5">




<pre class="src src-xml">&lt;<span style="color: #0000ff;">bean</span> <span style="color: #b8860b;">id</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">sessionFactory</span><span style="color: #bc8f8f;">"</span> <span style="color: #b8860b;">class</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">org.springframework.orm.hibernate4.LocalSessionFactoryBean</span><span style="color: #bc8f8f;">"</span> &gt;
      &lt;<span style="color: #0000ff;">property</span> <span style="color: #b8860b;">name</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">dataSource</span><span style="color: #bc8f8f;">"</span> <span style="color: #b8860b;">ref</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">dataSource</span><span style="color: #bc8f8f;">"</span>/&gt;
      &lt;<span style="color: #0000ff;">property</span> <span style="color: #b8860b;">name</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">packagesToScan</span><span style="color: #bc8f8f;">"</span>&gt;
                      &lt;<span style="color: #0000ff;">list</span>&gt;
                              &lt;<span style="color: #0000ff;">value</span>&gt;cn.javass&lt;/<span style="color: #0000ff;">value</span>&gt;
                      &lt;/<span style="color: #0000ff;">list</span>&gt;
              &lt;/<span style="color: #0000ff;">property</span>&gt;
      &lt;<span style="color: #0000ff;">property</span> <span style="color: #b8860b;">name</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">hibernateProperties</span><span style="color: #bc8f8f;">"</span>&gt;
          &lt;<span style="color: #0000ff;">props</span>&gt;
              &lt;<span style="color: #0000ff;">prop</span> <span style="color: #b8860b;">key</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">hibernate.dialect</span><span style="color: #bc8f8f;">"</span>&gt;${hibernate.dialect}&lt;/<span style="color: #0000ff;">prop</span>&gt;
              &lt;<span style="color: #0000ff;">prop</span> <span style="color: #b8860b;">key</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">hibernate.show_sql</span><span style="color: #bc8f8f;">"</span>&gt;${hibernate.show_sql}&lt;/<span style="color: #0000ff;">prop</span>&gt;
              &lt;<span style="color: #0000ff;">prop</span> <span style="color: #b8860b;">key</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">hibernate.format_sql</span><span style="color: #bc8f8f;">"</span>&gt;true&lt;/<span style="color: #0000ff;">prop</span>&gt;
              &lt;<span style="color: #0000ff;">prop</span> <span style="color: #b8860b;">key</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">hibernate.query.substitutions</span><span style="color: #bc8f8f;">"</span>&gt;${hibernate.query.substitutions}&lt;/<span style="color: #0000ff;">prop</span>&gt;
              &lt;<span style="color: #0000ff;">prop</span> <span style="color: #b8860b;">key</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">hibernate.default_batch_fetch_size</span><span style="color: #bc8f8f;">"</span>&gt;${hibernate.default_batch_fetch_size}&lt;/<span style="color: #0000ff;">prop</span>&gt;
              &lt;<span style="color: #0000ff;">prop</span> <span style="color: #b8860b;">key</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">hibernate.max_fetch_depth</span><span style="color: #bc8f8f;">"</span>&gt;${hibernate.max_fetch_depth}&lt;/<span style="color: #0000ff;">prop</span>&gt;
              &lt;<span style="color: #0000ff;">prop</span> <span style="color: #b8860b;">key</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">hibernate.generate_statistics</span><span style="color: #bc8f8f;">"</span>&gt;${hibernate.generate_statistics}&lt;/<span style="color: #0000ff;">prop</span>&gt;
              &lt;<span style="color: #0000ff;">prop</span> <span style="color: #b8860b;">key</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">hibernate.bytecode.use_reflection_optimizer</span><span style="color: #bc8f8f;">"</span>&gt;${hibernate.bytecode.use_reflection_optimizer}&lt;/<span style="color: #0000ff;">prop</span>&gt;

              &lt;<span style="color: #0000ff;">prop</span> <span style="color: #b8860b;">key</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">hibernate.cache.use_second_level_cache</span><span style="color: #bc8f8f;">"</span>&gt;${hibernate.cache.use_second_level_cache}&lt;/<span style="color: #0000ff;">prop</span>&gt;
              &lt;<span style="color: #0000ff;">prop</span> <span style="color: #b8860b;">key</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">hibernate.cache.use_query_cache</span><span style="color: #bc8f8f;">"</span>&gt;${hibernate.cache.use_query_cache}&lt;/<span style="color: #0000ff;">prop</span>&gt;
              &lt;<span style="color: #0000ff;">prop</span> <span style="color: #b8860b;">key</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">hibernate.cache.region.factory_class</span><span style="color: #bc8f8f;">"</span>&gt;${hibernate.cache.region.factory_class}&lt;/<span style="color: #0000ff;">prop</span>&gt;
              &lt;<span style="color: #0000ff;">prop</span> <span style="color: #b8860b;">key</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">net.sf.ehcache.configurationResourceName</span><span style="color: #bc8f8f;">"</span>&gt;${net.sf.ehcache.configurationResourceName}&lt;/<span style="color: #0000ff;">prop</span>&gt;
              &lt;<span style="color: #0000ff;">prop</span> <span style="color: #b8860b;">key</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">hibernate.cache.use_structured_entries</span><span style="color: #bc8f8f;">"</span>&gt;${hibernate.cache.use_structured_entries}&lt;/<span style="color: #0000ff;">prop</span>&gt;
          &lt;/<span style="color: #0000ff;">props</span>&gt;
      &lt;/<span style="color: #0000ff;">property</span>&gt;
      &lt;/<span style="color: #0000ff;">bean</span>&gt;
</pre>

</div>

</div>

<div id="outline-container-1-4-6" class="outline-4">
<h4 id="sec-1-4-6"><span class="section-number-4">1.4.6</span> 开启aop的监听</h4>
<div class="outline-text-4" id="text-1-4-6">




<pre class="src src-xml"><span style="color: #b22222;">&lt;!--</span><span style="color: #b22222;"> &#24320;&#21551;AOP&#30417;&#21548; &#21482;&#23545;&#24403;&#21069;&#37197;&#32622;&#25991;&#20214;&#26377;&#25928; </span><span style="color: #b22222;">--&gt;</span>
      &lt;<span style="color: #da70d6;">aop</span>:<span style="color: #0000ff;">aspectj-autoproxy</span> <span style="color: #b8860b;">expose-proxy</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">true</span><span style="color: #bc8f8f;">"</span>/&gt;
</pre>

</div>

</div>
