others/项目构建笔记.html

<div id="outline-container-1-4-7" class="outline-4">
<h4 id="sec-1-4-7"><span class="section-number-4">1.4.7</span> 开启aop的注解事务</h4>
<div class="outline-text-4" id="text-1-4-7">




<pre class="src src-xml"><span style="color: #b22222;">&lt;!--</span><span style="color: #b22222;"> &#24320;&#21551;&#27880;&#35299;&#20107;&#21153; &#21482;&#23545;&#24403;&#21069;&#37197;&#32622;&#25991;&#20214;&#26377;&#25928; </span><span style="color: #b22222;">--&gt;</span>
      &lt;<span style="color: #da70d6;">tx</span>:<span style="color: #0000ff;">annotation-driven</span> <span style="color: #b8860b;">transaction-manager</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">txManager</span><span style="color: #bc8f8f;">"</span>/&gt;

  &lt;<span style="color: #0000ff;">bean</span> <span style="color: #b8860b;">id</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">txManager</span><span style="color: #bc8f8f;">"</span> <span style="color: #b8860b;">class</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">org.springframework.orm.hibernate4.HibernateTransactionManager</span><span style="color: #bc8f8f;">"</span>&gt;
      &lt;<span style="color: #0000ff;">property</span> <span style="color: #b8860b;">name</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">sessionFactory</span><span style="color: #bc8f8f;">"</span> <span style="color: #b8860b;">ref</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">sessionFactory</span><span style="color: #bc8f8f;">"</span>/&gt;
  &lt;/<span style="color: #0000ff;">bean</span>&gt;

  &lt;<span style="color: #da70d6;">tx</span>:<span style="color: #0000ff;">advice</span> <span style="color: #b8860b;">id</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">txAdvice</span><span style="color: #bc8f8f;">"</span> <span style="color: #b8860b;">transaction-manager</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">txManager</span><span style="color: #bc8f8f;">"</span>&gt;
      &lt;<span style="color: #da70d6;">tx</span>:<span style="color: #0000ff;">attributes</span>&gt;
          &lt;<span style="color: #da70d6;">tx</span>:<span style="color: #0000ff;">method</span> <span style="color: #b8860b;">name</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">save*</span><span style="color: #bc8f8f;">"</span> <span style="color: #b8860b;">propagation</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">REQUIRED</span><span style="color: #bc8f8f;">"</span> /&gt;
          &lt;<span style="color: #da70d6;">tx</span>:<span style="color: #0000ff;">method</span> <span style="color: #b8860b;">name</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">add*</span><span style="color: #bc8f8f;">"</span> <span style="color: #b8860b;">propagation</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">REQUIRED</span><span style="color: #bc8f8f;">"</span> /&gt;
          &lt;<span style="color: #da70d6;">tx</span>:<span style="color: #0000ff;">method</span> <span style="color: #b8860b;">name</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">create*</span><span style="color: #bc8f8f;">"</span> <span style="color: #b8860b;">propagation</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">REQUIRED</span><span style="color: #bc8f8f;">"</span> /&gt;
          &lt;<span style="color: #da70d6;">tx</span>:<span style="color: #0000ff;">method</span> <span style="color: #b8860b;">name</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">insert*</span><span style="color: #bc8f8f;">"</span> <span style="color: #b8860b;">propagation</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">REQUIRED</span><span style="color: #bc8f8f;">"</span> /&gt;
          &lt;<span style="color: #da70d6;">tx</span>:<span style="color: #0000ff;">method</span> <span style="color: #b8860b;">name</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">update*</span><span style="color: #bc8f8f;">"</span> <span style="color: #b8860b;">propagation</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">REQUIRED</span><span style="color: #bc8f8f;">"</span> /&gt;
          &lt;<span style="color: #da70d6;">tx</span>:<span style="color: #0000ff;">method</span> <span style="color: #b8860b;">name</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">merge*</span><span style="color: #bc8f8f;">"</span> <span style="color: #b8860b;">propagation</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">REQUIRED</span><span style="color: #bc8f8f;">"</span> /&gt;
          &lt;<span style="color: #da70d6;">tx</span>:<span style="color: #0000ff;">method</span> <span style="color: #b8860b;">name</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">del*</span><span style="color: #bc8f8f;">"</span> <span style="color: #b8860b;">propagation</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">REQUIRED</span><span style="color: #bc8f8f;">"</span> /&gt;
          &lt;<span style="color: #da70d6;">tx</span>:<span style="color: #0000ff;">method</span> <span style="color: #b8860b;">name</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">remove*</span><span style="color: #bc8f8f;">"</span> <span style="color: #b8860b;">propagation</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">REQUIRED</span><span style="color: #bc8f8f;">"</span> /&gt;
          &lt;<span style="color: #da70d6;">tx</span>:<span style="color: #0000ff;">method</span> <span style="color: #b8860b;">name</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">put*</span><span style="color: #bc8f8f;">"</span> <span style="color: #b8860b;">propagation</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">REQUIRED</span><span style="color: #bc8f8f;">"</span> /&gt;
          &lt;<span style="color: #da70d6;">tx</span>:<span style="color: #0000ff;">method</span> <span style="color: #b8860b;">name</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">use*</span><span style="color: #bc8f8f;">"</span> <span style="color: #b8860b;">propagation</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">REQUIRED</span><span style="color: #bc8f8f;">"</span>/&gt;
          <span style="color: #b22222;">&lt;!--</span><span style="color: #b22222;">hibernate4&#24517;&#39035;&#37197;&#32622;&#20026;&#24320;&#21551;&#20107;&#21153; &#21542;&#21017; getCurrentSession()&#33719;&#21462;&#19981;&#21040;</span><span style="color: #b22222;">--&gt;</span>
          &lt;<span style="color: #da70d6;">tx</span>:<span style="color: #0000ff;">method</span> <span style="color: #b8860b;">name</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">get*</span><span style="color: #bc8f8f;">"</span> <span style="color: #b8860b;">propagation</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">REQUIRED</span><span style="color: #bc8f8f;">"</span> <span style="color: #b8860b;">read-only</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">true</span><span style="color: #bc8f8f;">"</span> /&gt;
          &lt;<span style="color: #da70d6;">tx</span>:<span style="color: #0000ff;">method</span> <span style="color: #b8860b;">name</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">count*</span><span style="color: #bc8f8f;">"</span> <span style="color: #b8860b;">propagation</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">REQUIRED</span><span style="color: #bc8f8f;">"</span> <span style="color: #b8860b;">read-only</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">true</span><span style="color: #bc8f8f;">"</span> /&gt;
          &lt;<span style="color: #da70d6;">tx</span>:<span style="color: #0000ff;">method</span> <span style="color: #b8860b;">name</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">find*</span><span style="color: #bc8f8f;">"</span> <span style="color: #b8860b;">propagation</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">REQUIRED</span><span style="color: #bc8f8f;">"</span> <span style="color: #b8860b;">read-only</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">true</span><span style="color: #bc8f8f;">"</span> /&gt;
          &lt;<span style="color: #da70d6;">tx</span>:<span style="color: #0000ff;">method</span> <span style="color: #b8860b;">name</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">list*</span><span style="color: #bc8f8f;">"</span> <span style="color: #b8860b;">propagation</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">REQUIRED</span><span style="color: #bc8f8f;">"</span> <span style="color: #b8860b;">read-only</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">true</span><span style="color: #bc8f8f;">"</span> /&gt;
          &lt;<span style="color: #da70d6;">tx</span>:<span style="color: #0000ff;">method</span> <span style="color: #b8860b;">name</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">*</span><span style="color: #bc8f8f;">"</span> <span style="color: #b8860b;">read-only</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">true</span><span style="color: #bc8f8f;">"</span> /&gt;
      &lt;/<span style="color: #da70d6;">tx</span>:<span style="color: #0000ff;">attributes</span>&gt;
  &lt;/<span style="color: #da70d6;">tx</span>:<span style="color: #0000ff;">advice</span>&gt;
  &lt;<span style="color: #da70d6;">aop</span>:<span style="color: #0000ff;">config</span> <span style="color: #b8860b;">expose-proxy</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">true</span><span style="color: #bc8f8f;">"</span>&gt;
      <span style="color: #b22222;">&lt;!--</span><span style="color: #b22222;"> &#21482;&#23545;&#19994;&#21153;&#36923;&#36753;&#23618;&#23454;&#26045;&#20107;&#21153; </span><span style="color: #b22222;">--&gt;</span>
      &lt;<span style="color: #da70d6;">aop</span>:<span style="color: #0000ff;">pointcut</span> <span style="color: #b8860b;">id</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">txPointcut</span><span style="color: #bc8f8f;">"</span> <span style="color: #b8860b;">expression</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">execution(* cn.javass..service..*.*(..))</span><span style="color: #bc8f8f;">"</span> /&gt;
      &lt;<span style="color: #da70d6;">aop</span>:<span style="color: #0000ff;">advisor</span> <span style="color: #b8860b;">advice-ref</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">txAdvice</span><span style="color: #bc8f8f;">"</span> <span style="color: #b8860b;">pointcut-ref</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">txPointcut</span><span style="color: #bc8f8f;">"</span>/&gt;
  &lt;/<span style="color: #da70d6;">aop</span>:<span style="color: #0000ff;">config</span>&gt;
</pre>

</div>
</div>

</div>
