others/项目构建笔记.html

<div id="outline-container-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> spring-mvc配置</h3>
<div class="outline-text-3" id="text-1-5">


</div>

<div id="outline-container-1-5-1" class="outline-4">
<h4 id="sec-1-5-1"><span class="section-number-4">1.5.1</span> 自定义类型绑定接口</h4>
<div class="outline-text-4" id="text-1-5-1">




<pre class="src src-xml"> <span style="color: #b22222;">&lt;!--</span><span style="color: #b22222;"> &#20250;&#33258;&#21160;&#27880;&#20876;&#20102;validator  ConversionService  </span><span style="color: #b22222;">--&gt;</span>
   &lt;<span style="color: #da70d6;">mvc</span>:<span style="color: #0000ff;">annotation-driven</span> <span style="color: #b8860b;">validator</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">validator</span><span style="color: #bc8f8f;">"</span> <span style="color: #b8860b;">conversion-service</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">conversion-service</span><span style="color: #bc8f8f;">"</span>/&gt;
<span style="color: #b22222;">&lt;!--</span><span style="color: #b22222;"> &#20197;&#19979; validator  ConversionService &#22312;&#20351;&#29992; mvc:annotation-driven &#20250; &#33258;&#21160;&#27880;&#20876;</span><span style="color: #b22222;">--&gt;</span>
   &lt;<span style="color: #0000ff;">bean</span> <span style="color: #b8860b;">id</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">validator</span><span style="color: #bc8f8f;">"</span> <span style="color: #b8860b;">class</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">org.springframework.validation.beanvalidation.LocalValidatorFactoryBean</span><span style="color: #bc8f8f;">"</span>&gt;
       &lt;<span style="color: #0000ff;">property</span> <span style="color: #b8860b;">name</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">providerClass</span><span style="color: #bc8f8f;">"</span>  <span style="color: #b8860b;">value</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">org.hibernate.validator.HibernateValidator</span><span style="color: #bc8f8f;">"</span>/&gt;
       <span style="color: #b22222;">&lt;!--</span><span style="color: #b22222;"> &#22914;&#26524;&#19981;&#21152;&#40664;&#35748;&#21040; &#20351;&#29992;classpath&#19979;&#30340; ValidationMessages.properties </span><span style="color: #b22222;">--&gt;</span>
       &lt;<span style="color: #0000ff;">property</span> <span style="color: #b8860b;">name</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">validationMessageSource</span><span style="color: #bc8f8f;">"</span> <span style="color: #b8860b;">ref</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">messageSource</span><span style="color: #bc8f8f;">"</span>/&gt;
   &lt;/<span style="color: #0000ff;">bean</span>&gt;
    &lt;<span style="color: #0000ff;">bean</span> <span style="color: #b8860b;">id</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">conversion-service</span><span style="color: #bc8f8f;">"</span> <span style="color: #b8860b;">class</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">org.springframework.format.support.FormattingConversionServiceFactoryBean</span><span style="color: #bc8f8f;">"</span>  /&gt; 
</pre>


</div>

</div>

<div id="outline-container-1-5-2" class="outline-4">
<h4 id="sec-1-5-2"><span class="section-number-4">1.5.2</span> 开启springmvn的注解</h4>
<div class="outline-text-4" id="text-1-5-2">




<pre class="src src-xml"><span style="color: #b22222;">&lt;!--</span><span style="color: #b22222;"> &#24320;&#21551;controller&#27880;&#35299;&#25903;&#25345; </span><span style="color: #b22222;">--&gt;</span>
  <span style="color: #b22222;">&lt;!--</span><span style="color: #b22222;"> &#27880;&#65306;&#22914;&#26524;base-package=cn.javass &#21017;&#27880;&#35299;&#20107;&#21153;&#19981;&#36215;&#20316;&#29992; TODO &#35835;&#28304;&#30721; </span><span style="color: #b22222;">--&gt;</span>
  &lt;<span style="color: #da70d6;">context</span>:<span style="color: #0000ff;">component-scan</span> <span style="color: #b8860b;">base-package</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">cn.javass.demo.web.controller</span><span style="color: #bc8f8f;">"</span>&gt;
      &lt;<span style="color: #da70d6;">context</span>:<span style="color: #0000ff;">include-filter</span> <span style="color: #b8860b;">type</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">annotation</span><span style="color: #bc8f8f;">"</span> <span style="color: #b8860b;">expression</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">org.springframework.stereotype.Controller</span><span style="color: #bc8f8f;">"</span>/&gt;
  &lt;/<span style="color: #da70d6;">context</span>:<span style="color: #0000ff;">component-scan</span>&gt;
</pre>


</div>

</div>
