others/项目构建笔记.html

<div id="outline-container-1-5-3" class="outline-4">
<h4 id="sec-1-5-3"><span class="section-number-4">1.5.3</span> 视图配置</h4>
<div class="outline-text-4" id="text-1-5-3">




<pre class="src src-xml">  <span style="color: #b22222;">&lt;!--</span><span style="color: #b22222;"> ========================= VIEW&#23450;&#20041; ========================= </span><span style="color: #b22222;">--&gt;</span>
    <span style="color: #b22222;">&lt;!--</span><span style="color: #b22222;"> bean name view resolver</span><span style="color: #b22222;">--&gt;</span>
    &lt;<span style="color: #0000ff;">bean</span> <span style="color: #b8860b;">class</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">org.springframework.web.servlet.view.BeanNameViewResolver</span><span style="color: #bc8f8f;">"</span> <span style="color: #da70d6;">p</span>:<span style="color: #b8860b;">order</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">0</span><span style="color: #bc8f8f;">"</span>/&gt;  

    <span style="color: #b22222;">&lt;!--</span><span style="color: #b22222;"> &#26681;&#25454;&#23458;&#25143;&#31471;&#30340;&#19981;&#21516;&#30340;&#35831;&#27714;&#20915;&#23450;&#19981;&#21516;&#30340; view&#36827;&#34892;&#21709;&#24212;, &#22914; /blog/1.json /blog/1.xml </span><span style="color: #b22222;">--&gt;</span>  
    &lt;<span style="color: #0000ff;">bean</span> <span style="color: #b8860b;">class</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">org.springframework.web.servlet.view.ContentNegotiatingViewResolver</span><span style="color: #bc8f8f;">"</span> <span style="color: #da70d6;">p</span>:<span style="color: #b8860b;">order</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">1</span><span style="color: #bc8f8f;">"</span>&gt;  
        <span style="color: #b22222;">&lt;!--</span><span style="color: #b22222;"> &#35774;&#32622;&#20026;true&#20197;&#24573;&#30053;&#23545;Accept Header&#30340;&#25903;&#25345;</span><span style="color: #b22222;">--&gt;</span>  
        <span style="color: #b22222;">&lt;!--</span><span style="color: #b22222;"> &#25193;&#23637;&#21517;&#33267;mimeType&#30340;&#26144;&#23556;,&#21363; /user.json =&gt; application/json </span><span style="color: #b22222;">--&gt;</span>  
        &lt;<span style="color: #0000ff;">property</span> <span style="color: #b8860b;">name</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">favorPathExtension</span><span style="color: #bc8f8f;">"</span> <span style="color: #b8860b;">value</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">false</span><span style="color: #bc8f8f;">"</span>/&gt;  

         <span style="color: #b22222;">&lt;!--</span><span style="color: #b22222;"> &#29992;&#20110;&#24320;&#21551; /userinfo/123?format=json &#30340;&#25903;&#25345; </span><span style="color: #b22222;">--&gt;</span>  
         &lt;<span style="color: #0000ff;">property</span> <span style="color: #b8860b;">name</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">favorParameter</span><span style="color: #bc8f8f;">"</span> <span style="color: #b8860b;">value</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">false</span><span style="color: #bc8f8f;">"</span>/&gt;  

        &lt;<span style="color: #0000ff;">property</span> <span style="color: #b8860b;">name</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">mediaTypes</span><span style="color: #bc8f8f;">"</span>&gt;  <span style="color: #b22222;">&lt;!--</span><span style="color: #b22222;">favorPathExtension, favorParameter&#26159;true&#26102;&#25165;&#36215;&#20316;&#29992;  </span><span style="color: #b22222;">--&gt;</span>
            &lt;<span style="color: #0000ff;">map</span>&gt;  
<span style="color: #b22222;">&lt;!--</span><span style="color: #b22222;">                &lt;entry key="wml" value="text/vnd.wap.wml"/&gt;</span><span style="color: #b22222;">--&gt;</span>
<span style="color: #b22222;">&lt;!--</span><span style="color: #b22222;">                &lt;entry key="vnd" value="application/vnd.wap.xhtml+xml"/&gt;</span><span style="color: #b22222;">--&gt;</span>
<span style="color: #b22222;">&lt;!--</span><span style="color: #b22222;">                &lt;entry key="xhtml" value="application/xhtml+xml"/&gt;</span><span style="color: #b22222;">--&gt;</span>
                &lt;<span style="color: #0000ff;">entry</span> <span style="color: #b8860b;">key</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">html</span><span style="color: #bc8f8f;">"</span> <span style="color: #b8860b;">value</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">*</span><span style="color: #bc8f8f;">"</span>/&gt;
            &lt;/<span style="color: #0000ff;">map</span>&gt;  
         &lt;/<span style="color: #0000ff;">property</span>&gt;  
         &lt;<span style="color: #0000ff;">property</span> <span style="color: #b8860b;">name</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">viewResolvers</span><span style="color: #bc8f8f;">"</span>&gt;  
             &lt;<span style="color: #0000ff;">list</span>&gt;  
                &lt;<span style="color: #0000ff;">bean</span> <span style="color: #b8860b;">class</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">org.springframework.web.servlet.view.InternalResourceViewResolver</span><span style="color: #bc8f8f;">"</span>&gt;
                    &lt;<span style="color: #0000ff;">property</span> <span style="color: #b8860b;">name</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">viewClass</span><span style="color: #bc8f8f;">"</span> <span style="color: #b8860b;">value</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">org.springframework.web.servlet.view.JstlView</span><span style="color: #bc8f8f;">"</span>/&gt;
                    &lt;<span style="color: #0000ff;">property</span> <span style="color: #b8860b;">name</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">contentType</span><span style="color: #bc8f8f;">"</span> <span style="color: #b8860b;">value</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">text/html</span><span style="color: #bc8f8f;">"</span>/&gt;
                    &lt;<span style="color: #0000ff;">property</span> <span style="color: #b8860b;">name</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">prefix</span><span style="color: #bc8f8f;">"</span> <span style="color: #b8860b;">value</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">/WEB-INF/jsp/</span><span style="color: #bc8f8f;">"</span>/&gt;
                    &lt;<span style="color: #0000ff;">property</span> <span style="color: #b8860b;">name</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">suffix</span><span style="color: #bc8f8f;">"</span> <span style="color: #b8860b;">value</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">.jsp</span><span style="color: #bc8f8f;">"</span>/&gt;
                &lt;/<span style="color: #0000ff;">bean</span>&gt;
            &lt;/<span style="color: #0000ff;">list</span>&gt;  
        &lt;/<span style="color: #0000ff;">property</span>&gt;  
        <span style="color: #b22222;">&lt;!--</span><span style="color: #b22222;"> &#21487;&#37197;&#32622;Not Found url</span>
<span style="color: #b22222;">        &lt;property name="defaultViews"&gt;</span>
<span style="color: #b22222;">            &lt;list&gt;  </span>
<span style="color: #b22222;">                 &lt;bean class="org.springframework.web.servlet.view.JstlView" p:url="/notfound"/&gt;  </span>
<span style="color: #b22222;">            &lt;/list&gt;  </span>
<span style="color: #b22222;">        &lt;/property&gt;  </span><span style="color: #b22222;">--&gt;</span> 
    &lt;/<span style="color: #0000ff;">bean</span>&gt;  
    <span style="color: #b22222;">&lt;!--</span><span style="color: #b22222;"> &#40664;&#35748;&#30340;&#35270;&#22270;&#35299;&#26512;&#22120; &#22312;&#19978;&#36793;&#30340;&#35299;&#26512;&#38169;&#35823;&#26102;&#20351;&#29992; (&#40664;&#35748;&#20351;&#29992;html)- </span><span style="color: #b22222;">--&gt;</span>
    &lt;<span style="color: #0000ff;">bean</span> <span style="color: #b8860b;">id</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">defaultViewResolver</span><span style="color: #bc8f8f;">"</span> <span style="color: #b8860b;">class</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">org.springframework.web.servlet.view.InternalResourceViewResolver</span><span style="color: #bc8f8f;">"</span> <span style="color: #da70d6;">p</span>:<span style="color: #b8860b;">order</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">3</span><span style="color: #bc8f8f;">"</span>&gt;
        &lt;<span style="color: #0000ff;">property</span> <span style="color: #b8860b;">name</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">viewClass</span><span style="color: #bc8f8f;">"</span> <span style="color: #b8860b;">value</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">org.springframework.web.servlet.view.JstlView</span><span style="color: #bc8f8f;">"</span>/&gt;
        &lt;<span style="color: #0000ff;">property</span> <span style="color: #b8860b;">name</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">contentType</span><span style="color: #bc8f8f;">"</span> <span style="color: #b8860b;">value</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">text/html</span><span style="color: #bc8f8f;">"</span>/&gt;        
        &lt;<span style="color: #0000ff;">property</span> <span style="color: #b8860b;">name</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">prefix</span><span style="color: #bc8f8f;">"</span> <span style="color: #b8860b;">value</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">/WEB-INF/jsp/</span><span style="color: #bc8f8f;">"</span>/&gt;
        &lt;<span style="color: #0000ff;">property</span> <span style="color: #b8860b;">name</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">suffix</span><span style="color: #bc8f8f;">"</span> <span style="color: #b8860b;">value</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">.jsp</span><span style="color: #bc8f8f;">"</span>/&gt;
    &lt;/<span style="color: #0000ff;">bean</span>&gt;
</pre>



</div>

</div>

<div id="outline-container-1-5-4" class="outline-4">
<h4 id="sec-1-5-4"><span class="section-number-4">1.5.4</span> json视图</h4>
<div class="outline-text-4" id="text-1-5-4">




<pre class="src src-xml"><span style="color: #b22222;">&lt;!--</span><span style="color: #b22222;"> json view </span><span style="color: #b22222;">--&gt;</span>
 &lt;<span style="color: #0000ff;">bean</span> <span style="color: #b8860b;">id</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">defaultJsonView</span><span style="color: #bc8f8f;">"</span> <span style="color: #b8860b;">class</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">org.springframework.web.servlet.view.json.MappingJacksonJsonView</span><span style="color: #bc8f8f;">"</span>/&gt;
</pre>

</div>

</div>

<div id="outline-container-1-5-5" class="outline-4">
<h4 id="sec-1-5-5"><span class="section-number-4">1.5.5</span> 上传配置</h4>
<div class="outline-text-4" id="text-1-5-5">




<pre class="src src-xml"><span style="color: #b22222;">&lt;!--</span><span style="color: #b22222;"> &#25991;&#20214;&#19978;&#20256;&#30456;&#20851; </span><span style="color: #b22222;">--&gt;</span>
 &lt;<span style="color: #0000ff;">bean</span> <span style="color: #b8860b;">id</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">multipartResolver</span><span style="color: #bc8f8f;">"</span> <span style="color: #b8860b;">class</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">org.springframework.web.multipart.commons.CommonsMultipartResolver</span><span style="color: #bc8f8f;">"</span>&gt;
     <span style="color: #b22222;">&lt;!--</span><span style="color: #b22222;">one of the properties available;the maximum file size in bytes</span><span style="color: #b22222;">--&gt;</span>
     &lt;<span style="color: #0000ff;">property</span> <span style="color: #b8860b;">name</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">maxUploadSize</span><span style="color: #bc8f8f;">"</span> <span style="color: #b8860b;">value</span>=<span style="color: #bc8f8f;">"</span><span style="color: #bc8f8f;">100000</span><span style="color: #bc8f8f;">"</span>/&gt;
 &lt;/<span style="color: #0000ff;">bean</span>&gt;
</pre>


</div>

</div>
